InformationRegisters/Renault_ЖурналПроверкиАКБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЖурналПроверкиАКБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПриПриеме</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки40Дней</Name>
					<Comment>40 дней с даты MADC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки80Дней</Name>
					<Comment>80 дней с даты MADC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки120Дней</Name>
					<Comment>120 дней с даты MADC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки160Дней</Name>
					<Comment>160 дней с даты MADC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеПриПриеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеПриПроверке40Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеПриПроверке80Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеПриПроверке120Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапряжениеПриПроверке160Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Advanced_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Advanced_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_Advanced_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Renault_Advanced_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЖурналПроверкиАКБ/Forms/ФормаЖурналаПроверкиАКБ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Территория = ПолучитьЗначениеНастройки(ПараметрыСеанса.Пользователь, "ГруппаДоступностиСкладов");
	мДоступныеСклады = ПолучитьСписокДоступныхСкладов();
	
	Если НЕ ЗначениеЗаполнено(мДоступныеСклады) Тогда
		
		Сообщить("У пользователя не заданы доступные склады автомобилей.");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.Территория.СписокВыбора.ЗагрузитьЗначения(мДоступныеСклады);
	ДоступныеСклады.ЗагрузитьЗначения(мДоступныеСклады);
	УО = ДинамическийСписок.УсловноеОформление.Элементы;
	ЭлементУО = УО.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуетсяЗарядкаАКБ");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Отказ тогда
		ОбновлениеДинамическихДанных();
		ПодключитьОбработчикОжидания("ОбновлениеДинамическихДанных", 20, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДинамическихДанных()
	
	ПараметрыДинСписка	= ДинамическийСписок.Параметры;
	
	Если Не ЗначениеЗаполнено(Территория) Тогда
	    Склад = ДоступныеСклады.ВыгрузитьЗначения();
	иначе
		Склад = Территория; ;
	КонецЕсли;
	
	//ОтборПоТерритории = ?(Территория = Справочники.СкладыКомпании.ПустаяСсылка(), Ложь, Истина);
	
	//ПараметрыДинСписка.УстановитьЗначениеПараметра("ЕстьОтборПоТерритории", ОтборПоТерритории);
	ПараметрыДинСписка.УстановитьЗначениеПараметра("Территория", Склад);
	ПараметрыДинСписка.УстановитьЗначениеПараметра("текДата", ТекущаяДата());
	ПараметрыДинСписка.УстановитьЗначениеПараметра("ТребуетсяЗарядка", ТребуетсяЗарядитьАКБ);
	ПараметрыДинСписка.УстановитьЗначениеПараметра("ПоказыватьПроданныеАвтомобили", ПоказыватьПроданныеАвтомобили);

	Элементы.ДинамическийСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТерриторияПриИзменении(Элемент)
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки	= Элементы.ДинамическийСписок.ДанныеСтроки(ВыбраннаяСтрока);
	
	ДанныеОткрытия	= Новый Структура;
	ДанныеОткрытия.Вставить("Автомобиль",	ДанныеСтроки.Автомобиль);
	ОткрытьФормуМодально("РегистрСведений.Renault_ЖурналПроверкиАКБ.Форма.ФормаЗаписи", ДанныеОткрытия);
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяЗарядитьАКБПриИзменении(Элемент)
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПроданныеАвтомобилиПриИзменении(Элемент)
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеНастройки(Пользователь, Настройка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_Advanced_НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.Renault_Advanced_НастройкиПользователей КАК Renault_Advanced_НастройкиПользователей
		|ГДЕ
		|	Renault_Advanced_НастройкиПользователей.Пользователь = &Пользователь
		|	И Renault_Advanced_НастройкиПользователей.Настройка.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Настройка);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;

КонецФункции // ПолучитьЗначениеНастройки()

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхСкладов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки
		|ПОМЕСТИТЬ ПраваИНастройки
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_ПраваИНастройкиПользователейАвтосклад_ДоступныеСклады.Склад
		|ИЗ
		|	Справочник.Renault_ПраваИНастройкиПользователей.Автосклад_ДоступныеСклады КАК Renault_ПраваИНастройкиПользователейАвтосклад_ДоступныеСклады
		|ГДЕ
		|	Renault_ПраваИНастройкиПользователейАвтосклад_ДоступныеСклады.Ссылка В
		|			(ВЫБРАТЬ
		|				ПраваИНастройки_.ПраваИНастройки
		|			ИЗ
		|				ПраваИНастройки КАК ПраваИНастройки_)";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	    Территория = ПолучитьЗначениеНастройки(ПараметрыСеанса.Пользователь, "ГруппаДоступностиСкладов");
	Иначе
	    Территория = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Склад");
	КонецЕсли;

	Возврат Территория;	

КонецФункции // ПолучитьСписокДоступныхСкладов()
